#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2019/11/1 11:34
# @Author  : Lodge


CHROME_PORT = 16881
# chrome.exe --remote-debugging-port=16881 --user-data-dir="C:\selenium_ali_ad1\AutomationProfile"
LIMIT_PAGE = 5   # 页数超过了限定页数退出,限定多少页来处理这个广告(不包含当前页)
RECEIVERS = ''

# 下面是默认的我们的产品ID,刷点击的时候需要忽略
OUR_PRODUCT_ID = [
    '4000320919983',
    '32971247675',
    '32961187679',
    '32962923195',
    '32970987767',
    '32963254246',
    '4000075521477',
    '4000289010170',
    '4000311304726',
    '4000212188044',
    '32966220376',
    '4000311726859',
    '32959839163',
    '4000259496978',
    '33059583386',
    '32966435634',
]
